stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_flash.h
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_flash.h
  * @author  MCD Application Team
  * @brief   Header file of FLASH HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U3xx_HAL_FLASH_H
#define STM32U3xx_HAL_FLASH_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal_def.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

/** @addtogroup FLASH
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup FLASH_Exported_Types FLASH Exported Types
  * @{
  */

/**
  * @brief  FLASH Erase structure definition
  */
typedef struct
{
  uint32_t TypeErase; /*!< Mass erase or page erase.
                           This parameter can be a value of @ref FLASH_Type_Erase */
  uint32_t Banks;     /*!< Select bank to erase.
                           This parameter must be a value of @ref FLASH_Banks
                           (FLASH_BANK_BOTH should be used only for mass erase) */
  uint32_t Page;      /*!< Initial Flash page to erase when page erase is enabled
                           This parameter must be a value between 0 and (max number of pages - 1) */
  uint32_t NbPages;   /*!< Number of pages to be erased.
                           This parameter must be a value between 1 and (max number of pages - value of initial page)*/
} FLASH_EraseInitTypeDef;

/**
  * @brief  FLASH Option Bytes Program structure definition
  */
typedef struct
{
  uint32_t OptionType;      /*!< Option byte to be configured.
                                 This parameter can be a combination of the values of @ref FLASH_OB_Type */
  uint32_t WRPArea;         /*!< Write protection area to be programmed (used for @ref OPTIONBYTE_WRP).
                                 Only one WRP area could be programmed at the same time.
                                 This parameter can be value of @ref FLASH_OB_WRP_Area */
  uint32_t WRPStartOffset;  /*!< Write protection start offset (used for @ref OPTIONBYTE_WRP).
                                 This parameter must be a value between 0 and (max number of pages - 1) */
  uint32_t WRPEndOffset;    /*!< Write protection end offset (used for @ref OPTIONBYTE_WRP).
                                 This parameter must be a value between WRPStartOffset and (max number of pages - 1) */
  FunctionalState WRPLock;  /*!< Write protection lock (used for @ref OPTIONBYTE_WRP).
                                 This parameter can be set to ENABLE or DISABLE */
  uint32_t RDPLevel;        /*!< Set the read protection level (used for @ref OPTIONBYTE_RDP).
                                 This parameter can be a value of @ref FLASH_OB_Read_Protection */
  uint32_t USERType;        /*!< User option byte(s) to be configured (used for @ref OPTIONBYTE_USER).
                                 This parameter can be a combination of @ref FLASH_OB_USER_Type */
  uint32_t USERConfig;      /*!< Value of the user option byte (used for @ref OPTIONBYTE_USER).
                                 This parameter can be a combination of @ref FLASH_OB_USER_BOR_LEVEL,
                                 @ref FLASH_OB_USER_NRST_STOP, @ref FLASH_OB_USER_NRST_STANDBY,
                                 @ref FLASH_OB_USER_NRST_SHUTDOWN, @ref FLASH_OB_USER_BDRST_POR,
                                 @ref FLASH_OB_USER_SRAM1_RST, @ref FLASH_OB_USER_IWDG_SW,
                                 @ref FLASH_OB_USER_IWDG_STOP, @ref FLASH_OB_USER_IWDG_STANDBY,
                                 @ref FLASH_OB_USER_WWDG_SW, @ref FLASH_OB_USER_SWAP_BANK,
                                 @ref FLASH_OB_USER_DUALBANK, @ref FLASH_OB_USER_SRAM2_PE,
                                 @ref FLASH_OB_USER_SRAM2_RST, @ref FLASH_OB_USER_NSWBOOT0,
                                 @ref FLASH_OB_USER_NBOOT0, @ref FLASH_OB_USER_IO_VDD_HSLV,
                                 @ref FLASH_OB_USER_IO_VDDIO2_HSLV, @ref FLASH_OB_USER_TZEN */
#if defined (CPU_IN_SECURE_STATE)
  uint32_t WMSecConfig;      /*!< Configuration of the Watermark-based Secure Area (used for @ref OPTIONBYTE_WMSEC).
                                  This parameter must be a value of @ref FLASH_OB_WMSEC */
  uint32_t WMSecStartPage;   /*!< Start page of secure area (used for @ref OPTIONBYTE_WMSEC).
                                  This parameter must be a value between 0 and (max number of pages in the bank - 1) */
  uint32_t WMSecEndPage;     /*!< End page of secure area (used for @ref OPTIONBYTE_WMSEC).
                                  This parameter must be a value between WMSecStartPage and
                                  (max number of pages in the bank - 1) */
  uint32_t WMHDPEndPage;     /*!< End page of the secure hide protection (used for @ref OPTIONBYTE_WMSEC).
                                  This parameter must be a value between WMSecStartPage and WMSecEndPage */
  uint32_t BootLock;         /*!< Configuration of the boot lock (used for @ref OPTIONBYTE_BOOT_LOCK).
                                  This parameter must be a value of @ref FLASH_OB_BOOT_LOCK */
#endif /* CPU_IN_SECURE_STATE */
  uint32_t BootAddrConfig;   /*!< Configuration of the Boot address (used for @ref OPTIONBYTE_BOOTADDR).
                                  This parameter must be a value of @ref FLASH_OB_BOOTADDR */
  uint32_t BootAddr;         /*!< Boot address (used for @ref OPTIONBYTE_BOOTADDR).
                                  This parameter must be a value between 0x0 and 0xFFFFFF00 */
  uint32_t RDPKeyType;       /*!< Configuration of the RDP OEM keys (used for @ref OPTIONBYTE_RDPKEY).
                                  This parameter can be a value of @ref FLASH_OB_RDP_Key_Type */
  uint32_t RDPKey1;          /*!< Value of the RDP OEM key - bits[0:31] (used for @ref OPTIONBYTE_RDPKEY) */
  uint32_t RDPKey2;          /*!< Value of the RDP OEM key - bits[32:63] (used for @ref OPTIONBYTE_RDPKEY) */
  uint32_t RDPKey3;          /*!< Value of the RDP OEM key - bits[64:95] (used for @ref OPTIONBYTE_RDPKEY) */
  uint32_t RDPKey4;          /*!< Value of the RDP OEM key - bits[96:127] (used for @ref OPTIONBYTE_RDPKEY) */
} FLASH_OBProgramInitTypeDef;

/**
  * @brief  FLASH handle Structure definition
  */
typedef struct
{
  HAL_LockTypeDef     Lock;              /*!< FLASH locking object */
  uint32_t            ErrorCode;         /*!< FLASH error code */
  uint32_t            ProcedureOnGoing;  /*!< Internal variable to indicate which procedure is ongoing
                                              or not in IT context */
  uint32_t            Address;           /*!< Internal variable to save address selected for program in IT context */
  uint32_t            Bank;              /*!< Internal variable to save current bank selected during erase
                                              in IT context */
  uint32_t            Page;              /*!< Internal variable to define the current page which is erasing
                                              in IT context */
  uint32_t            NbPagesToErase;    /*!< Internal variable to save the remaining pages to erase in IT context */
} FLASH_ProcessTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup FLASH_Exported_Constants FLASH Exported Constants
  * @{
  */

