stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_flash.h
/** @defgroup FLASH_Flags FLASH Flags Definition
  * @{
  */
#if defined (CPU_IN_SECURE_STATE)
#define FLASH_FLAG_EOP         FLASH_SSR_EOP                  /*!< FLASH End of operation flag */
#define FLASH_FLAG_OPERR       FLASH_SSR_OPERR                /*!< FLASH Operation error flag */
#define FLASH_FLAG_PROGERR     FLASH_SSR_PROGERR              /*!< FLASH Programming error flag */
#define FLASH_FLAG_WRPERR      FLASH_SSR_WRPERR               /*!< FLASH Write protection error flag */
#define FLASH_FLAG_PGAERR      FLASH_SSR_PGAERR               /*!< FLASH Programming alignment error flag */
#define FLASH_FLAG_SIZERR      FLASH_SSR_SIZERR               /*!< FLASH Size error flag */
#define FLASH_FLAG_PGSERR      FLASH_SSR_PGSERR               /*!< FLASH Programming sequence error flag */
#define FLASH_FLAG_OPTWERR     FLASH_SR_OPTWERR               /*!< FLASH Option modification error flag  */
#define FLASH_FLAG_BSY         FLASH_SSR_BSY                  /*!< FLASH Busy flag */
#define FLASH_FLAG_WDW         FLASH_SSR_WDW                  /*!< FLASH Wait Data to Write flag */
#define FLASH_FLAG_ECCC        FLASH_ECCCR_ECCC               /*!< FLASH ECC correction */
#define FLASH_FLAG_ECCD        FLASH_ECCDR_ECCD               /*!< FLASH ECC detection */

#define FLASH_FLAG_SR_ERRORS   (FLASH_FLAG_OPERR  | FLASH_FLAG_PROGERR | FLASH_FLAG_WRPERR | \
                                FLASH_FLAG_PGAERR | FLASH_FLAG_SIZERR  | FLASH_FLAG_PGSERR)
#define FLASH_FLAG_ECCR_ERRORS (FLASH_FLAG_ECCC      | FLASH_FLAG_ECCD)
#define FLASH_FLAG_ALL_ERRORS  (FLASH_FLAG_SR_ERRORS | FLASH_FLAG_OPTWERR | FLASH_FLAG_ECCR_ERRORS)
#else /* CPU_IN_SECURE_STATE */
#define FLASH_FLAG_EOP         FLASH_SR_EOP                   /*!< FLASH End of operation flag */
#define FLASH_FLAG_OPERR       FLASH_SR_OPERR                 /*!< FLASH Operation error flag */
#define FLASH_FLAG_PROGERR     FLASH_SR_PROGERR               /*!< FLASH Programming error flag */
#define FLASH_FLAG_WRPERR      FLASH_SR_WRPERR                /*!< FLASH Write protection error flag */
#define FLASH_FLAG_PGAERR      FLASH_SR_PGAERR                /*!< FLASH Programming alignment error flag */
#define FLASH_FLAG_SIZERR      FLASH_SR_SIZERR                /*!< FLASH Size error flag  */
#define FLASH_FLAG_PGSERR      FLASH_SR_PGSERR                /*!< FLASH Programming sequence error flag */
#define FLASH_FLAG_OPTWERR     FLASH_SR_OPTWERR               /*!< FLASH Option modification error flag  */
#define FLASH_FLAG_BSY         FLASH_SR_BSY                   /*!< FLASH Busy flag */
#define FLASH_FLAG_WDW         FLASH_SR_WDW                   /*!< FLASH Wait Data to Write flag */
#define FLASH_FLAG_OEM1LOCK    FLASH_SR_OEM1LOCK              /*!< FLASH OEM1 key RDP lock flag */
#define FLASH_FLAG_OEM2LOCK    FLASH_SR_OEM2LOCK              /*!< FLASH OEM2 key RDP lock flag */
#define FLASH_FLAG_PD1         FLASH_SR_PD1                   /*!< FLASH Bank1 in power-down mode flag */
#define FLASH_FLAG_PD2         FLASH_SR_PD2                   /*!< FLASH Bank2 in power-down mode flag */
#define FLASH_FLAG_ECCC        FLASH_ECCCR_ECCC               /*!< FLASH ECC correction */
#define FLASH_FLAG_ECCD        FLASH_ECCDR_ECCD               /*!< FLASH ECC detection */

#define FLASH_FLAG_SR_ERRORS   (FLASH_FLAG_OPERR  | FLASH_FLAG_PROGERR | FLASH_FLAG_WRPERR  | \
                                FLASH_FLAG_PGAERR | FLASH_FLAG_SIZERR  | FLASH_FLAG_PGSERR  | \
                                FLASH_FLAG_OPTWERR)
#define FLASH_FLAG_ECCR_ERRORS (FLASH_FLAG_ECCC      | FLASH_FLAG_ECCD)
#define FLASH_FLAG_ALL_ERRORS  (FLASH_FLAG_SR_ERRORS | FLASH_FLAG_ECCR_ERRORS)
#endif /* CPU_IN_SECURE_STATE */
/**
  * @}
  */

/** @defgroup FLASH_Interrupt_definition FLASH Interrupts Definition
  * @brief FLASH Interrupt definition
  * @{
  */
#if defined (CPU_IN_SECURE_STATE)
#define FLASH_IT_EOP     FLASH_SCR_EOPIE                              /*!< End of FLASH Operation Interrupt source */
#define FLASH_IT_OPERR   FLASH_SCR_ERRIE                              /*!< Error Interrupt source */
#define FLASH_IT_ECCC    (FLASH_ECCCR_ECCIE >> FLASH_ECCCR_ECCIE_Pos) /*!< ECC Correction Interrupt source */
#else /* CPU_IN_SECURE_STATE */
#define FLASH_IT_EOP     FLASH_CR_EOPIE                               /*!< End of FLASH Operation Interrupt source */
#define FLASH_IT_OPERR   FLASH_CR_ERRIE                               /*!< Error Interrupt source */
#define FLASH_IT_ECCC    (FLASH_ECCCR_ECCIE >> FLASH_ECCCR_ECCIE_Pos) /*!< ECC Correction Interrupt source */
#endif /* CPU_IN_SECURE_STATE */
/**
  * @}
  */

/** @defgroup FLASH_Error FLASH Error
  * @{
  */
#define HAL_FLASH_ERROR_NONE   0x00000000U        /*!< Flash no error */
#define HAL_FLASH_ERROR_OP     FLASH_FLAG_OPERR   /*!< Flash operation error */
#define HAL_FLASH_ERROR_PROG   FLASH_FLAG_PROGERR /*!< Flash programming error */
#define HAL_FLASH_ERROR_WRP    FLASH_FLAG_WRPERR  /*!< Flash write protection error */
#define HAL_FLASH_ERROR_PGA    FLASH_FLAG_PGAERR  /*!< Flash programming alignment error */
#define HAL_FLASH_ERROR_SIZ    FLASH_FLAG_SIZERR  /*!< Flash size error */
#define HAL_FLASH_ERROR_PGS    FLASH_FLAG_PGSERR  /*!< Flash programming sequence error */
#define HAL_FLASH_ERROR_OPTW   FLASH_FLAG_OPTWERR /*!< Flash option modification error */
#define HAL_FLASH_ERROR_ECCC   FLASH_FLAG_ECCC    /*!< Flash ECC correction error */
#define HAL_FLASH_ERROR_ECCD   FLASH_FLAG_ECCD    /*!< Flash ECC detection error */
/**
  * @}
  */

/** @defgroup FLASH_Type_Erase FLASH Erase Type
  * @{
  */
#if defined (CPU_IN_SECURE_STATE)
#define FLASH_TYPEERASE_PAGES        FLASH_SCR_PER \
  /*!< Secure pages erase activation */
#define FLASH_TYPEERASE_PAGES_NS     (FLASH_CR_PER  | FLASH_NON_SECURE_MASK) \
  /*!< Non-secure pages erase activation */
#define FLASH_TYPEERASE_MASSERASE    (FLASH_SCR_MER1 | FLASH_SCR_MER2) \
  /*!< Secure flash mass erase activation */
#define FLASH_TYPEERASE_MASSERASE_NS (FLASH_CR_MER1 | FLASH_CR_MER2 | FLASH_NON_SECURE_MASK) \
  /*!< Non-secure flash mass erase activation */
#else /* CPU_IN_SECURE_STATE */
#define FLASH_TYPEERASE_PAGES        FLASH_CR_PER \
  /*!< Pages erase activation */
#define FLASH_TYPEERASE_MASSERASE    (FLASH_CR_MER1 | FLASH_CR_MER2) \
  /*!< Flash mass erase activation */
#endif /* CPU_IN_SECURE_STATE */
/**
  * @}
  */

/** @defgroup FLASH_Banks FLASH Banks
  * @{
  */
#define FLASH_BANK_1      FLASH_CR_MER1                 /*!< Bank 1 */
#define FLASH_BANK_2      FLASH_CR_MER2                 /*!< Bank 2 */
#define FLASH_BANK_BOTH   (FLASH_BANK_1 | FLASH_BANK_2) /*!< Bank 1 and Bank 2 */
/**
  * @}
  */

/** @defgroup FLASH_Type_Program FLASH Program Type
  * @{
  */
#if defined (CPU_IN_SECURE_STATE)
#define FLASH_TYPEPROGRAM_DOUBLEWORD    FLASH_SCR_PG \
  /*!< Program a double-word (64-bit) at a specified secure address */
#define FLASH_TYPEPROGRAM_DOUBLEWORD_NS (FLASH_CR_PG | FLASH_NON_SECURE_MASK) \
  /*!< Program a double-word (64-bit) at a specified non-secure address */
#define FLASH_TYPEPROGRAM_BURST         (FLASH_SCR_PG | FLASH_SCR_BWR) \
  /*!< Program a burst (16xdouble-word) at a specified secure address */
#define FLASH_TYPEPROGRAM_BURST_NS      (FLASH_CR_PG | FLASH_CR_BWR | FLASH_NON_SECURE_MASK) \
  /*!< Program a burst (16xdouble-word) at a specified non-secure address */
#else /* CPU_IN_SECURE_STATE */
#define FLASH_TYPEPROGRAM_DOUBLEWORD    FLASH_CR_PG \
  /*!<Program a double-word (64-bit) at a specified address */
#define FLASH_TYPEPROGRAM_BURST         (FLASH_CR_PG | FLASH_CR_BWR) \
  /*!<Program a burst (16xdouble-word) at a specified address */
#endif /* CPU_IN_SECURE_STATE */
/**
  * @}
  */

/** @defgroup FLASH_OB_Type FLASH Option Bytes Type
  * @{
  */
#define OPTIONBYTE_WRP        0x00000001U /*!< WRP option byte configuration */
#define OPTIONBYTE_RDP        0x00000002U /*!< RDP option byte configuration */
#define OPTIONBYTE_USER       0x00000004U /*!< USER option byte configuration */
#define OPTIONBYTE_BOOTADDR   0x00000008U /*!< Boot address option byte configuration */
#if defined (CPU_IN_SECURE_STATE)
#define OPTIONBYTE_WMSEC      0x00000010U /*!< Watermark-based secure area option byte configuration */
#define OPTIONBYTE_BOOT_LOCK  0x00000020U /*!< Boot lock option byte configuration */
#endif /* CPU_IN_SECURE_STATE */
#define OPTIONBYTE_RDPKEY     0x00000040U /*!< RDP Key option byte configuration */
/**
  * @}
  */

/** @defgroup FLASH_OB_WRP_Area FLASH WRP Area
  * @{
  */
#define OB_WRPAREA_BANK1_AREAA   0x00000001U /*!< Flash Bank 1 Area A */
#define OB_WRPAREA_BANK1_AREAB   0x00000002U /*!< Flash Bank 1 Area B */
#define OB_WRPAREA_BANK2_AREAA   0x00000004U /*!< Flash Bank 2 Area A */
#define OB_WRPAREA_BANK2_AREAB   0x00000008U /*!< Flash Bank 2 Area B */
/**
  * @}
  */

/** @defgroup FLASH_OB_Read_Protection FLASH Option Bytes Read Protection
  * @{
  */
#define OB_RDP_LEVEL_0   0xAAU /*!< RDP level 0 code */
#define OB_RDP_LEVEL_0_5 0x55U /*!< RDP level 0.5 code */
#define OB_RDP_LEVEL_1   0xBBU /*!< RDP level 1 code */
#define OB_RDP_LEVEL_2   0xCCU /*!< RDP level 2 code */
/**
  * @}
  */

/** @defgroup FLASH_OB_RDP_Key_Type FLASH Option Bytes Read Protection Key Type
  * @{
  */
#define OB_RDP_KEY_OEM1 0x01U  /*!< OEM1 key */
#define OB_RDP_KEY_OEM2 0x02U  /*!< OEM2 key */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_Type FLASH Option Bytes User Type
  * @{
  */
#define OB_USER_BOR_LEV        FLASH_OPTR_BOR_LEV        /*!< BOR reset Level */
#define OB_USER_BDRST_POR      FLASH_OPTR_BDRST_POR      /*!< Backup domain reset with power on reset */
#define OB_USER_NRST_STOP      FLASH_OPTR_nRST_STOP      /*!< Reset generated when entering the stop mode */
#define OB_USER_NRST_STDBY     FLASH_OPTR_nRST_STDBY     /*!< Reset generated when entering the standby mode */
#define OB_USER_NRST_SHDW      FLASH_OPTR_nRST_SHDW      /*!< Reset generated when entering the shutdown mode */
#define OB_USER_SRAM1_RST      FLASH_OPTR_SRAM1_RST      /*!< SRAM1 erase upon system reset */
#define OB_USER_IWDG_SW        FLASH_OPTR_IWDG_SW        /*!< Independent watchdog selection */
#define OB_USER_IWDG_STOP      FLASH_OPTR_IWDG_STOP      /*!< Independent watchdog counter freeze in stop mode */
#define OB_USER_IWDG_STDBY     FLASH_OPTR_IWDG_STDBY     /*!< Independent watchdog counter freeze in standby mode */
#define OB_USER_WWDG_SW        FLASH_OPTR_WWDG_SW        /*!< Window watchdog selection */
#define OB_USER_SWAP_BANK      FLASH_OPTR_SWAP_BANK      /*!< Swap banks */
#define OB_USER_DUALBANK       FLASH_OPTR_DUALBANK       /*!< Dual-Bank on 1MB/512kB Flash memory devices */
#define OB_USER_SRAM2_PE       FLASH_OPTR_SRAM2_PE       /*!< SRAM2 parity check enable */
#define OB_USER_SRAM2_RST      FLASH_OPTR_SRAM2_RST      /*!< SRAM2 erase when system reset */
#define OB_USER_NSWBOOT0       FLASH_OPTR_nSWBOOT0       /*!< Software BOOT0 */
#define OB_USER_NBOOT0         FLASH_OPTR_nBOOT0         /*!< nBOOT0 option bit */
#define OB_USER_IO_VDD_HSLV    FLASH_OPTR_IO_VDD_HSLV    /*!< High speed IO at low VDD voltage configuration bit */
#define OB_USER_IO_VDDIO2_HSLV FLASH_OPTR_IO_VDDIO2_HSLV /*!< High speed IO at low VDDIO2 voltage configuration bit */
#define OB_USER_TZEN           FLASH_OPTR_TZEN           /*!< Global TrustZone security enable */

